code/openfoam/tutorials/incompressibleVoF/floatingObjectWaves/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        waveAlpha;
    libs        ("libwaves.so");
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sides
    {
        type            waveAlpha;
        libs            ("libwaves.so");
    }

    bottom
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }

    floatingObject
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
