code/openfoam/tutorials/incompressibleVoF/floatingObjectWaves/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            rigidBodyMotion;

    libs            ("librigidBodyMeshMotion.so");

    report          on;

    solver
    {
        type Newmark;
    }

    accelerationRelaxation 0.7;

    exterior
    {
        innerDistance   0.05;
        outerDistance   0.35;
    }

    bodies
    {
        floatingObject
        {
            type            cuboid;
            parent          root;

            // Cuboid dimensions
            L               (0.3 0.2 0.5);

            // Density of the cuboid
            rho             500;

            // Cuboid mass
            mass            #calc "$rho*cmptProduct($<vector>L)";
            centreOfMass    (0 0 0.25);
            transform       (1 0 0 0 1 0 0 0 1) (0.5 0.45 0.1);

            joint
            {
                type            composite;
                joints
                (
                    {
                        type Py;
                    }
                    {
                        type Ry;
                    }
                );
            }

            patches         (floatingObject);
            innerDistance   0.05;
            outerDistance   0.35;
        }
    }
}


// ************************************************************************* //
